wegam/STM32F1xWorkSpace/Examples/HC/PL012V30AMP.C
///******************** (C) COPYRIGHT 2008 STMicroelectronics ********************
//* File Name          : PC001V21.c
//* Author             : WOW
//* Version            : V2.0.1
//* Date               : 06/26/2017
//* Description        : PC001V21层控制板.
//********************************************************************************
//* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
//* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
//* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
//* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
//* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
//* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
//*******************************************************************************/

#ifdef PL012V30AMP				//拆零柜LCD板

#include "PL012V30AMP.H"

#include "LCD.H"


#include "STM32_GPIO.H"
#include "STM32_SYS.H"
#include "STM32_SYSTICK.H"
#include "STM32_WDG.H"
#include "STM32_PWM.H"
#include "STM32_USART.H"
#include	"AMP_PHY.H"


#include "SWITCHID.H"

//#include "string.h"				//串和内存操作函数头文件


LCDDef	sLCD;
RS485Def RS485;
unsigned char RxdBuffe[128]={0};
unsigned short time	=	0;

char tep[1]={'A'};

unsigned char Version[]="PL012V3.0 RF智能耗材管理柜";
unsigned char DataStr[]=__DATE__;
unsigned char	TimeStr[]=__TIME__;
//SWITCHID_CONF	SWITCHID;
//u8 SwitchID=0;	//拔码开关地址

/*******************************************************************************
* 函数名		:	
* 功能描述	:	 
* 输入		:	
* 输出		:
* 返回 		:
*******************************************************************************/
void PL012V30AMP_Configuration(void)
{
	SYS_Configuration();					//系统配置---打开系统时钟 STM32_SYS.H
	
	GPIO_DeInitAll();							//将所有的GPIO关闭----V20170605
	
	LCD_Configuration();

//	GT32L32_Configuration();
//	
//	R61509V_Configuration();
//	
//	CS5530_Configuration();
//	
	RS485_Configuration();
//	
//	LCD_PowerUp();
//	
//	SwitchID_Configuration();
//	
	//LCD_Printf(0,140,16,LCD565_RED,"显示驱动:%4X",LCD_ReadData(LCD_R000_IR));		//编译日期
	LCD_Printf(0,160,16,LCD565_RED,"项目编号:%s",Version);		//编译日期
	LCD_Printf(0,180,16,LCD565_RED,"编译日期:%s",__DATE__);		//编译日期
	LCD_Printf(0,200,16,LCD565_RED,"编译时间:%s",__TIME__); 	//编译时间 
	
	SysTick_Configuration(1000);	//系统嘀嗒时钟配置72MHz,单位为uS

//	IWDG_Configuration(1000);			//独立看门狗配置---参数单位ms	
	PWM_OUT(TIM2,PWM_OUTChannel1,1,900);	//PWM设定-20161127版本--指示灯
	
//	LCD_Printf(0,140,16,LCD565_RED,"显示驱动:%4X",LCD_ReadData(LCD_R000_IR));		//编译日期
	
	PWM_OUT(TIM2,PWM_OUTChannel3,500,200);		//PWM设定-20161127版本--背光
//	memset(TxdBuffe,0xA5,128);
//	LCD_Printf(0,0,32,"后边的省略号就是可变参数喂狗");		//后边的省略号就是可变参数
}
/*******************************************************************************
* 函数名		:	
* 功能描述	:	 
* 输入		:	
* 输出		:
* 返回 		:
*******************************************************************************/
void PL012V30AMP_Server(void)
{	
	u16 Num=0;
	IWDG_Feed();								//独立看门狗喂狗
	if(time++>100)
	{
		time	=	0;
//		LCD_Clean(LCD565_BLACK);	//清除屏幕函数
	}
	RS485_Server();	
//	LCD_Printf(0,30,16,0,"ABCDefgh係边乽劑匑囀宮戁甅");		//后边的省略号就是可变参数
//	LCD_Printf(0,46,24,0,"ABCDefgh係边乽劑匑囀宮戁甅");		//后边的省略号就是可变参数
//	LCD_Printf(0,70,32,0,"ABCDefgh係边乽劑匑囀宮戁甅");		//后边的省略号就是可变参数
//	LCD_Show(0,70,32,strlen(tep),tep);
  LCD_ShowAntenna(220,0,0,LCD565_RED);   //显示12x12天线
  LCD_ShowAntenna(240,0,1,LCD565_RED);   //显示12x12天线
  LCD_ShowAntenna(260,0,2,LCD565_RED);   //显示12x12天线
  LCD_ShowAntenna(280,0,3,LCD565_RED);   //显示12x12天线
  LCD_ShowAntenna(300,0,4,LCD565_RED);   //显示12x12天线
  
  LCD_ShowBattery(320,0,0,LCD565_RED);   //显示12x12电池
  LCD_ShowBattery(340,0,1,LCD565_RED);   //显示12x12电池
  LCD_ShowBattery(360,0,2,LCD565_RED);   //显示12x12电池
  LCD_ShowBattery(380,0,3,LCD565_RED);   //显示12x12电池
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void LCD_Configuration(void)
{
	SPIDef				*SPIx;
	
	//==================字库配置
	SPIx		=	&(sLCD.GT32L32.SPI);
	
	SPIx->Port.SPIx=SPI1;
	
	SPIx->Port.CS_PORT		=	GPIOA;
	SPIx->Port.CS_Pin			=	GPIO_Pin_4;
	
	SPIx->Port.CLK_PORT		=	GPIOA;
	SPIx->Port.CLK_Pin		=	GPIO_Pin_5;
	
	SPIx->Port.MISO_PORT	=	GPIOA;
	SPIx->Port.MISO_Pin		=	GPIO_Pin_6;
	
	SPIx->Port.MOSI_PORT	=	GPIOA;
	SPIx->Port.MOSI_Pin		=	GPIO_Pin_7;
	
	SPIx->Port.SPI_BaudRatePrescaler_x=SPI_BaudRatePrescaler_2;
	
	//==================LCD配置
	sLCD.Port.sBL_PORT	=	GPIOA;
	sLCD.Port.sBL_Pin		=	GPIO_Pin_3;
	
	sLCD.Port.sCS_PORT	=	GPIOA;
	sLCD.Port.sCS_Pin		=	GPIO_Pin_12;
	
	sLCD.Port.sDC_PORT	=	GPIOA;
	sLCD.Port.sDC_Pin		=	GPIO_Pin_8;
	
	sLCD.Port.sRD_PORT	=	GPIOC;
	sLCD.Port.sRD_Pin		=	GPIO_Pin_5;
	
	sLCD.Port.sREST_PORT	=	GPIOD;
	sLCD.Port.sREST_Pin		=	GPIO_Pin_2;
	
	sLCD.Port.sTE_PORT		=	GPIOC;
	sLCD.Port.sTE_Pin			=	GPIO_Pin_4;
	
	sLCD.Port.sWR_PORT		=	GPIOA;
	sLCD.Port.sWR_Pin			=	GPIO_Pin_15;
	
	sLCD.Port.sDATABUS_PORT	=	GPIOB;
	sLCD.Port.sDATABUS_Pin	=	GPIO_Pin_All;	
	
	sLCD.Flag.Rotate			=	Draw_Rotate_90D;
	
	sLCD.Data.BColor			=	LCD565_YELLOW;
	sLCD.Data.PColor			=	LCD565_RED;
	
	//==================初始化
	LCD_Initialize(&sLCD);
	
//	R61509V_Initialize(&sLCD);
	
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void RS485_Server(void)
{
	unsigned short RxNum	=	0;
#if 1
	RxNum=RS485_ReadBufferIDLE(&RS485,RxdBuffe);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数，然后重新将接收缓冲区地址指向RxdBuffer
	if(RxNum)
	{
		unsigned	short	coler	=	0;
		unsigned	char*	addr	=	NULL;
		
		LCD_Fill(0,16,399,32,sLCD.Data.BColor);
		LCD_ShowHex(0,16,16,LCD565_RED,RxNum,8,RxdBuffe);                //显示十六进制数据
		addr	=	getheadaddr(RxdBuffe,RxNum);
		if(NULL==addr)
			return;
		coler	=	RxdBuffe[8]>>5;
		coler<<=5;
		coler|=RxdBuffe[9]>>5;
		coler<<=6;
		coler|=RxdBuffe[10]>>5;
		
