wegam/STM32F1xWorkSpace/Examples/HC/PL012V30AMP.C
		if(0	==	RxdBuffe[7])
		{
			LCD_Fill(0,64,399,160,coler);
		}
		else
		{
			LCD_Fill(0,64,399,160,LCD565_RED);
		}
	}
#else
	RxNum=RS485_ReadBufferIDLE(&RS485,(u32*)RevBuffe,(u32*)RxdBuffe);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数，然后重新将接收缓冲区地址指向RxdBuffer
	if(RxNum)
	{
		RS485Time	=	0;
		RS485FLG	=	1;
		RSRLen	=	RxNum;
		RS485_DMASend(&RS485,(u32*)RevBuffe,100);	//RS485-DMA发送程序
		PWM_OUT(TIM3,PWM_OUTChannel3,500,800);		//PWM设定-20161127版本--背光
	}
	if(RS485FLG	==	1)
	{
		if(RS485Time++>=500)
		{
			RS485Time	=	0;
			RS485_DMASend(&RS485,(u32*)RevBuffe,RSRLen);	//RS485-DMA发送程序
			RSRLen	=	0;
			RS485FLG	=	0;
			PWM_OUT(TIM3,PWM_OUTChannel3,500,800);		//PWM设定-20161127版本--背光
		}
	}
	
#endif
}

///*******************************************************************************
//* 函数名			:	function
//* 功能描述		:	函数功能说明 
//* 输入			: void
//* 返回值			: void
//* 修改时间		: 无
//* 修改内容		: 无
//* 其它			: wegam@sina.com
//*******************************************************************************/
//void SwitchID_Configuration(void)
//{
//	SWITCHID.NumOfSW	=	8;
//	
//	SWITCHID.SW1_PORT	=	GPIOD;
//	SWITCHID.SW1_Pin	=	GPIO_Pin_2;
//	
//	SWITCHID.SW2_PORT	=	GPIOA;
//	SWITCHID.SW2_Pin	=	GPIO_Pin_15;
//	
//	SWITCHID.SW3_PORT	=	GPIOA;
//	SWITCHID.SW3_Pin	=	GPIO_Pin_12;
//	
//	SWITCHID.SW4_PORT	=	GPIOA;
//	SWITCHID.SW4_Pin	=	GPIO_Pin_11;
//	
//	SWITCHID.SW5_PORT	=	GPIOA;
//	SWITCHID.SW5_Pin	=	GPIO_Pin_8;
//	
//	SWITCHID.SW6_PORT	=	GPIOB;
//	SWITCHID.SW6_Pin	=	GPIO_Pin_15;
//	
//	SWITCHID.SW7_PORT	=	GPIOB;
//	SWITCHID.SW7_Pin	=	GPIO_Pin_14;
//	
//	SWITCHID.SW8_PORT	=	GPIOB;
//	SWITCHID.SW8_Pin	=	GPIO_Pin_13;
//	
//	SwitchIdInitialize(&SWITCHID);							//
//	
////	SwitchID	=	SWITCHID_Read(&SWITCHID);		//
//}
///*******************************************************************************
//*函数名			:	function
//*功能描述		:	function
//*输入				: 
//*返回值			:	无
//*修改时间		:	无
//*修改说明		:	无
//*注释				:	wegam@sina.com
//*******************************************************************************/
//void SwitchID_Server(void)
//{
//	u8 temp=0;	//拔码开关临时地址
//	temp	=	SWITCHID_Read(&SWITCHID);		//读取地址
//	if(SwitchID	!=	temp)
//	{
//		u8 AddrH	=	0,AddrL	=	0;
//		u32	w=0,n=0,d=0;
////	w	=	1;n	=	0;
////	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
////	w	+=	1;n	+=	8;
////	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
////	w	+=	1;n	+=	8;
////	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
////	w	+=	1;n	+=	8;
////	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
////	w	+=	1;n	+=	8;
////	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
////	w	+=	1;n	+=	8;
////	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
////	w	+=	1;n	+=	8;
////	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
////	w	+=	1;n	+=	8;
////	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//		
//		w	=	12345678;
//		PL010V13_PrintfString(0		,0	,32	,"序号：");				//待发药槽位，后边的省略号就是可变参数
//		PL010V13_PrintfString(0		,32	,32	,"拔码：");				//待发药槽位，后边的省略号就是可变参数
//		PL010V13_PrintfString(96	,0	,32	,"%8d",w);				//待发药槽位，后边的省略号就是可变参数
//		w	=	0;
//		SwitchID	=	temp;
//		for(n=0;n<8;n++)
//		{
//			if((temp&0x01)	==0x01)
//			{
//				d	=	1;
//			}
//			else
//			{
//				d	=	0;
//			}
//			temp>>=1;
//			PL010V13_PrintfString(n*16+96		,32	,32	,"%d",d);				//待发药槽位，后边的省略号就是可变参数
//		}
//		AddrH	=	(SwitchID>>4)&0x0F;
//		AddrL	=	(SwitchID>>0)&0x0F;
//		PL010V13_PrintfString(0		,64	,32	,"层%0.2d，位%0.2d",AddrH,AddrL);				//待发药槽位，后边的省略号就是可变参数
//	}
//}

/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void RS485_Configuration(void)
{
	RS485.USARTx=USART1;
	RS485.RS485_CTL_PORT=GPIOA;
	RS485.RS485_CTL_Pin=GPIO_Pin_11;
	
	RS485_DMA_ConfigurationNR	(&RS485,19200,256);	//USART_DMA配置--查询方式，不开中断,配置完默认为接收状态
}
///*******************************************************************************
//* 函数名		:	
//* 功能描述	:	 
//* 输入		:	
//* 输出		:
//* 返回 		:
//*******************************************************************************/
//void LCD_PowerUp(void)
//{	
////	u16 i=0,j=0;
//	
//	
//	
//	
//	
////	R61509V_DrawDot(50,50,0X5458);
////	R61509V_DrawDot_big(50,50,0X5458);
////	R61509V_DrawLine(0,0,240,400,0X5458);
////	R61509V_DrawLine(0,400,240,0,0X5458);
//	
////	R61509V_DrawCircle(120,100, 50,0,0X5458);				//画一个圆形框
//	
////	R61509V_DrawCircle(120,200, 120,0,0X01CF);				//画一个圆形框
//	
////	R61509V_DrawCircle(120,400, 80,0,0X5458);				//画一个圆形框
////	
////	R61509V_DrawCircle(120,0, 80,0,0X5458);					//画一个圆形框
////	
////	R61509V_DrawCircle(120,200, 80,1,0X5458);				//画一个圆形框
////	
////	R61509V_DrawCircle(200,120, 50,0,0xF800);				//画一个圆形框
////	
////	R61509V_DrawCircle(120,200, 30,1,0X07FF);				//画一个圆形框
//	
////	R61509V_DrawRectangle(3,3,237,397,0x07E0);			//画一个矩形框
////	R61509V_DrawRectangle(4,4,236,396,0x07E0);			//画一个矩形框
////	R61509V_DrawRectangle(5,5,235,395,0x07E0);			//画一个矩形框
////	R61509V_DrawRectangle(6,6,234,394,0x07E0);			//画一个矩形框
////	
////	R61509V_DrawRectangle(7,7,233,393,0X07FF);			//画一个矩形框
////	R61509V_DrawRectangle(8,8,232,392,0X07FF);			//画一个矩形框
////	R61509V_DrawRectangle(9,9,231,391,0X07FF);			//画一个矩形框
////	R61509V_DrawRectangle(10,10,230,390,0X07FF);		//画一个矩形框
////	R61509V_DrawRectangle(11,11,229,389,0X07FF);		//画一个矩形框
////	R61509V_DrawRectangle(12,12,228,388,0X07FF);			//画一个矩形框
////	R61509V_DrawLine(12,12,228,388,0X5458);						//AB 两个坐标画一条直线
////	R61509V_DrawLine(12,388,228,12,0X5458);						//AB 两个坐标画一条直线
//	
////	R61509V_DrawLine(0,10,400,10,0X5458);						//AB 两个坐标画一条直线
////	
////	R61509V_DrawLine(0,20,400,20,0X5458);						//AB 两个坐标画一条直线
//	
////	R61509V_DrawLine(0,100,160,100,0X5458);						//AB 两个坐标画一条直线
////	
////	R61509V_DrawLine(80,0,80,400,0X5458);						//AB 两个坐标画一条直线
//	
////	R61509V_DrawRectangle(10,10,390,230,0X07FF);		//画一个矩形框
//	
////	R61509V_DrawCircle(200,120, 10,1,0X5458);					//画一个圆形框
////	
////	R61509V_DrawCircle(200,120, 80,0,0X5458);					//画一个圆形框
//	
////	R61509V_DrawLine(240,240,20,240,0X5458);						//AB 两个坐标画一条直线
//	
////	R61509V_ShowChar(1,1,32,100,zimo);								//高通字库测试程序
////	
////	R61509V_ShowCharT(50,50,15,0);
////	R61509V_ShowEn(200,120,12);
//	
////	PL010V13_PrintfString(0		,16	,16	,"待发药槽位：%3d",RevBuffe[0]);				//后边的省略号就是可变参数
////	PL010V13_PrintfString(0		,32	,16	,"待发药数量：%3d",RevBuffe[1]);				//后边的省略号就是可变参数

////	PL010V13_PrintfString(0		,0	,32	,"槽位-%2d数量-%2d",RevBuffe[0],RevBuffe[1]);				//后边的省略号就是可变参数
//	
////	PL010V13_PrintfString(0		,0	,32	,"待发药数量：%2d",RevBuffe[1]);				//后边的省略号就是可变参数
////	
////	
////	PL010V13_PrintfString(0		,100	,32	,"待发药数量：%2d",RevBuffe[1]);				//后边的省略号就是可变参数
////	PL010V13_PrintfString(0		,100	,32	,"待发药数量：%2d",RevBuffe[1]);				//后边的省略号就是可变参数
////	
//	#if 0
//	PL010Delay(0xFFFF);
//	PL010V13_PrintfString(1		,0	,16	,"待发药槽位：%2d",RevBuffe[0]);				//后边的省略号就是可变参数
//	PL010V13_PrintfString(1		,0	,16	,"待发药槽位：%2d",RevBuffe[0]);				//后边的省略号就是可变参数
//	PL010Delay(0xFFFF);
//	PL010V13_PrintfString(1		,20	,16	,"待发药数量：%2d",RevBuffe[1]);				//后边的省略号就是可变参数
//	PL010Delay(0xFFFF);
//	PL010V13_PrintfString(1		,40	,16	,"已发药数量：%2d",RevBuffe[1]);				//后边的省略号就是可变参数
//	PL010Delay(0xFFFF);
//	
////	PL010V13_PrintfString(0		,60	,16	,"总共请求数量：%4d",SumFQ);				//总共发药请求数量
////	PL010V13_PrintfString(0		,80	,16	,"总共发药数量：%4d",SumFed);				//总共已发药数量
//	PL010V13_PrintfString(1		,100	,16	,"错误状态：");				//错误状态
//	PL010Delay(0xFFFF);
//	
//	PL010V13_PrintfString(1		,160	,16	,"提示：长按3秒读取发药头");				//错误状态
//	PL010Delay(0xFFFF);
//	

//	//平行线
//	R61509V_DrawLine(221,0,221,400,R61509V_WHITE);						//AB 两个坐标画一条直线
//	R61509V_DrawLine(201,0,201,400,R61509V_WHITE);						//AB 两个坐标画一条直线
//	R61509V_DrawLine(181,0,181,400,R61509V_WHITE);						//AB 两个坐标画一条直线
//	R61509V_DrawLine(161,0,161,400,R61509V_WHITE);						//AB 两个坐标画一条直线
//	//垂直线--中
//	R61509V_DrawLine(161,200,221,200,R61509V_WHITE);					//AB 两个坐标画一条直线
//	//垂直线--右
//	R61509V_DrawLine(161,250-1,221,250-1,R61509V_WHITE);			//AB 两个坐标画一条直线
//	R61509V_DrawLine(161,300-1,221,300-1,R61509V_WHITE);			//AB 两个坐标画一条直线
//	R61509V_DrawLine(161,350-1,221,350-1,R61509V_WHITE);			//AB 两个坐标画一条直线
//	R61509V_DrawLine(161,400-1,221,400-1,R61509V_WHITE);			//AB 两个坐标画一条直线
//	
//	//垂直线--左
//	R61509V_DrawLine(161,1,221,1,					R61509V_WHITE);							//AB 两个坐标画一条直线
//	R61509V_DrawLine(161,51,221,51,				R61509V_WHITE);						//AB 两个坐标画一条直线
//	R61509V_DrawLine(161,101,221,101,			R61509V_WHITE);					//AB 两个坐标画一条直线
//	R61509V_DrawLine(161,151,221,151,			R61509V_WHITE);					//AB 两个坐标画一条直线

//	//填充
//	R61509V_Fill(2,180,50,200-2,R61509V_RED);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//	
//	
//	
//	
////	R61509V_DrawLine(10,200,10,280,R61509V_WHITE);						//AB 两个坐标画一条直线
//	
//	#else
////	R61509V_Clean(R61509V_WHITE);			//清除屏幕函数------
////	PL010Delay(0x8FFFFF);
//	R61509V_Clean(R61509V_BLUE);			//清除屏幕函数------
//	PL010Delay(0x8FFFFF);
//	R61509V_Clean(R61509V_GRED);			//清除屏幕函数------
//	PL010Delay(0x8FFFFF);
//	R61509V_Clean(R61509V_BLACK);			//清除屏幕函数------
//	PL010Delay(0x8FFFFF);
//	R61509V_Clean(R61509V_WHITE);			//清除屏幕函数------

