wegam/STM32F1xWorkSpace/Examples/HC/PL012V30AMP.C
////	PL010Delay(0xFFFF);
////	PL010V13_PrintfString(0	,0,16	,"TEST");				//错误状态
//	#endif
////	R61509V_Clean(R61509V_BLACK);			//清除屏幕函数------
//	
//}
///*******************************************************************************
//* 函数名			:	function
//* 功能描述		:	函数功能说明 
//* 输入			: void
//* 返回值			: void
//* 修改时间		: 无
//* 修改内容		: 无
//* 其它			: wegam@sina.com
//*******************************************************************************/
//void LCD_Display(void)
//{
//	PL010V13_PrintfString(0		,120	,16	,"显示测试！！！！！！！！！");				//错误状态
//	
//#if 0		
//	DSPTime++;
//	if(DSPTime>500)
//	{
//		DSPTime=0;
//		LCD_WXS();		//位显示
//		LCD_DDSP();		//显示总共请求数量和已发数量
//	}	
//	LCD_WS();		//位闪烁
//	
//	if(LCDTime>=1000)
//	{			
//		LCDTime=0;		
//	}	
//	
//	RxNum=RS485_ReadBufferIDLE(&RS485,(u32*)RevBuffe,(u32*)RxdBuffe);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数，然后重新将接收缓冲区地址指向RxdBuffer
//	if(RxNum==4&&RevBuffe[0]==0x00&&RevBuffe[1]==0xFF)		//RS485接收到数据
//	{
//		NumFW=RevBuffe[2];
//		PL010V13_PrintfString(96		,0	,16	,"%2d",RevBuffe[2]);				//待发药槽位，后边的省略号就是可变参数
//		PL010V13_PrintfString(96		,20	,16	,"%2d",RevBuffe[3]);				//待发药数量，后边的省略号就是可变参数
////		PL010V13_PrintfString(192		,68	,16	,"%2d",RevBuffe[1]);				//已发药数量，后边的省略号就是可变参数
//	}
//	else if(RxNum==3&&RevBuffe[0]==0x02)		//RS485接收到数据
//	{
//		SumFQ[RevBuffe[1]-1]+=RevBuffe[2];
//		NumFW=RevBuffe[1];
//		PL010V13_PrintfString(96		,0	,16	,"%2d",RevBuffe[1]);				//待发药槽位，后边的省略号就是可变参数
//		PL010V13_PrintfString(96		,20	,16	,"%2d",RevBuffe[2]);				//待发药数量，后边的省略号就是可变参数
//		PL010V13_PrintfString(96		,40	,16	,"%2d",0);									//已发药数量，后边的省略号就是可变参数
//		
////		PL010V13_PrintfString(0		,60	,16	,"总共请求数量：%4d",SumFQ);				//总共发药请求数量
//		PL010V13_PrintfString(0		,120	,16	,"正在发药！！！！！！！！！！");				//错误状态
//	}
//	else if(RxNum==4&&RevBuffe[0]==0x82)		//RS485接收到数据
//	{
//		SumFed[RevBuffe[1]-1]+=RevBuffe[2];
//		PL010V13_PrintfString(96		,0	,16	,"%2d",RevBuffe[1]);				//待发药槽位，后边的省略号就是可变参数
//		PL010V13_PrintfString(96		,20	,16	,"%2d",0);									//待发药数量，后边的省略号就是可变参数
//		PL010V13_PrintfString(96		,40	,16	,"%2d",RevBuffe[2]);				//已发药数量，后边的省略号就是可变参数		
//		
////		PL010V13_PrintfString(112		,80	,16	,"%4d",SumFed);					//总共已发药数量
//		
//	}
//	else if(RxNum==6&&RevBuffe[0]==0x81)	//槽位信息0x01--获取,0x81--上报
//	{
//		Onlinede=RevBuffe[4];
//	}
//	else if(RxNum==1&&RevBuffe[0]==0x01)	//槽位信息0x01--获取,0x81--上报
//	{
//		PL010V13_PrintfString(0		,120	,16		,"获取槽位信息！！！");				//错误状态
//		NumFW=0;
//		Onlinede=0;
//		memset(SumFed,0x00,8);
//		memset(SumFQ,0x00,8);

//		PL010V13_PrintfString(96		,0	,16	,"%2d",0);				//待发药槽位，后边的省略号就是可变参数
//		PL010V13_PrintfString(96		,20	,16	,"%2d",0);				//待发药数量，后边的省略号就是可变参数
//	}
//	
//	for(DelayTime=0;DelayTime<1000;DelayTime++)
//	{
//		
//	}
//	if(RxNum&&(RevBuffe[0]==0x82))		//错误状态显示
//	{
//		switch(RevBuffe[3])
//		{
//			case 0x00:	PL010V13_PrintfString(0		,120	,16	,"！！！！！！！！！！！！！！");				//错误状态
//				break;
//			case 0x80:	PL010V13_PrintfString(0		,120	,16	,"药品被卡住！！！！！！！！！");				//错误状态
//				break;
//			case 0x81:	PL010V13_PrintfString(0		,120	,16	,"缺药！！！！！！！！！！！！");				//错误状态
//				break;
//			case 0x82:	PL010V13_PrintfString(0		,120	,16	,"等待命令结果超时！！！！！！");				//错误状态
//				break;
//			case 0xC0:	PL010V13_PrintfString(0		,120	,16	,"单元柜控制器通信异常！！！！");				//错误状态
//				break;
//			case 0xC1:	PL010V13_PrintfString(0		,120	,16	,"发药层控制器通信异常！！！！");				//错误状态
//				break;
//		}
////		RevBuffe[0]=0;
////		RevBuffe[1]=0;
////		RevBuffe[2]=0;
////		RevBuffe[3]=0;
//	}
//#endif
//}
///*******************************************************************************
//*函数名		:	LCD_ShowString
//*功能描述	:	显示字符串高通字库
//*输入			: x,y:起点坐标
//						*p:字符串起始地址
//						用16字体
//*输出			:	无
//*返回值		:	无
//*例程			:
//*******************************************************************************/
//unsigned int PL010V13_PrintfString(u16 x,u16 y,u8 font,const char *format,...)				//后边的省略号就是可变参数
//{ 
//		
////		va_list ap; 										//VA_LIST 是在C语言中解决变参问题的一组宏，所在头文件：#include <stdarg.h>,用于获取不确定个数的参数
////		static char string[ 256 ];			//定义数组，
////  	va_start( ap, format );
////		vsprintf( string , format, ap );    
////		va_end( ap );
//	
////	char	*Char_Buffer=NULL;		//记录format内码
//	u16 i=0;		//显示

//	//1)**********获取数据宽度
//	u16 num=strlen((const char*)format);		//获取数据宽度
//	//2)**********定义缓冲区大小变量
//	unsigned int BufferSize;
//	//3)**********args为定义的一个指向可变参数的变量，va_list以及下边要用到的va_start,va_end都是是在定义，可变参数函数中必须要用到宏， 在stdarg.h头文件中定义
//	va_list args; 
//	free(Char_Buffer);						//释放动态空间	
//	//4)**********申请动态空间
////	Char_Buffer = (char*)malloc(sizeof(char) * num);
////	if(Char_Buffer==NULL)
////	{
////		Char_Buffer=NULL;
////		return 0;
////	}
//	//5)**********初始化args的函数，使其指向可变参数的第一个参数，format是可变参数的前一个参数
//	va_start(args, format);
//	//6)**********正常情况下返回生成字串的长度(除去\0),错误情况返回负值
//	BufferSize = vsprintf(Char_Buffer, format, args);
//	num=BufferSize;
//	//7)**********结束可变参数的获取
//	va_end(args);                                      		
//	//8)**********将等发送缓冲区大小（数据个数）及缓冲区地址发给DMA开启发送
////	while(*Char_Buffer!='\0')
//	for(i=0;i<num;i++)
//	{ 
//		unsigned char dst=Char_Buffer[i];
////		u8 GTBuffer[512]={0};		//点阵数据存储空间
//		u32 lengh=0;						//汉字点阵的数据长度		
//		if(dst>0x80)		//双字节--汉字
//		{
//			u16 word=dst<<8;			
////			Char_Buffer++;
//			dst=Char_Buffer[i+1];
//			word=word|dst;			
//			//显示超限判断
//			if(font==16&&x>R61509V_W-16)
//			{
//				x=0;
//				y+=16;
//			}
//			if(font==32&&x>R61509V_W-32)
//			{
//				x=0;
//				y+=32;
//			}
//			if(font==16&&y>R61509V_H-16)
//			{
//				y=x=0;
//			}
//			if(font==32&&y>R61509V_H-32)
//			{
//				y=x=0;
//			}
//			lengh=GT32L32_ReadBuffer(&GT32L32_Info,font,word,GT32L32_Info.GT32L32_Data.GT32L32_Buffer);		//从字库中读数据函数
//			//写入屏幕
//			R61509V_ShowChar(x,y,font,lengh,GT32L32_Info.GT32L32_Data.GT32L32_Buffer);
//			//显示地址增加	
//			if(font==12)
//			{
//				x+=12;
//			}
//			else if(font==16)
//			{
//				x+=16;
//			}
//			else if(font==24)
//			{
//				x+=24;
//			}
//			else if(font==32)
//			{
//				x+=32;
//			}
////			Char_Buffer++;
//			i++;		//双字节，减两次
//		}
//		else		//单字节
//		{			
//			if(x>R61509V_W-16)
//			{
//				x=0;
//				y+=32;
//			}
//			if(font==16&&y>R61509V_H-16)
//			{
//				y=x=0;
//			}
//			if(font==32&&y>R61509V_H-32)
//			{
//				y=x=0;
//			}
//			lengh=GT32L32_ReadBuffer(&GT32L32_Info,font,(u16)dst,GT32L32_Info.GT32L32_Data.GT32L32_Buffer);		//从字库中读数据函数
////			//写入屏幕
//			R61509V_ShowChar(x,y,font,lengh,GT32L32_Info.GT32L32_Data.GT32L32_Buffer);			
//			//显示地址增加
//			if(font==12)
//			{
//				x+=6;
//			}
//			else if(font==16)
//			{
//				x+=8;
//			}
//			else if(font==24)
//			{
//				x+=12;
//			}
//			else if(font==32)
//			{
//				x+=16;
//			}			
////			Char_Buffer++;
////			i++;		//双字节，减两次
//		}
//	}
//	//9)**********DMA发送完成后注意应该释放缓冲区：free(USART_BUFFER);
////	free(Char_Buffer);		//发送完成后注意应该释放缓冲区：free(Char_Buffer); 
//	return BufferSize;
//}
///*******************************************************************************
//* 函数名		:	
//* 功能描述	:	 
//* 输入		:	
//* 输出		:
//* 返回 		:
//*******************************************************************************/
//void PL010V13_DISPLAY(void)
//{
////	R61509V_DrawPixelEx( 100, 100,LCD_FORE_COLOR);
////	R61509V_DrawHLine( 10, 100, 200, LCD_FORE_COLOR);
//}
//void PL010Delay(u32 time)
//{	
//	while(time--);
//}
///*******************************************************************************
//* 函数名			:	function
//* 功能描述		:	函数功能说明 
//* 输入			: void
//* 返回值			: void
//*******************************************************************************/
//void LCD_WS(void)		//位闪烁
//{
//	if(NumFW)		//槽位闪烁	DSPTime
//	{
//		if(NumFW==1&&(Onlinede>>0&0x01))
//		{
//			if(DSPTime==500)
//			{
//				R61509V_Fill(2,180,50,200-2,R61509V_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//			}
//			else if(DSPTime==250)
//			{
//				R61509V_Fill(2,180,50,200-2,R61509V_MAGENTA);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//			}
//		}
//		else if(NumFW==2&&(Onlinede>>1&0x01))
//		{
//			if(DSPTime==500)
//			{
//				R61509V_Fill(52,180,100,200-2,R61509V_GBLUE);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//			}
//			else if(DSPTime==250)
//			{
//				R61509V_Fill(52,180,100,200-2,R61509V_MAGENTA);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//			}			
//		}
//		else if(NumFW==3&&(Onlinede>>2&0x01))
//		{
//			if(DSPTime==500)
//			{
//				R61509V_Fill(102,180,150,200-2,R61509V_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//			}
//			else if(DSPTime==250)
//			{
//				R61509V_Fill(102,180,150,200-2,R61509V_MAGENTA);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//			}			
//		}
//		else if(NumFW==4&&(Onlinede>>3&0x01))
//		{
//			if(DSPTime==500)
//			{
//				R61509V_Fill(152,180,200,200-2,R61509V_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//			}
//			else if(DSPTime==250)
//			{
//				R61509V_Fill(152,180,200,200-2,R61509V_MAGENTA);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//			}			
//		}
//		else if(NumFW==5&&(Onlinede>>4&0x01))
//		{
//			if(DSPTime==500)
//			{
//				R61509V_Fill(202,180,250,200-2,R61509V_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//			}
//			else if(DSPTime==250)
//			{
//				R61509V_Fill(202,180,250,200-2,R61509V_MAGENTA);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//			}			
//		}
//		else if(NumFW==6&&(Onlinede>>5&0x01))
//		{
//			if(DSPTime==500)
//			{
//				R61509V_Fill(252,180,300,200-2,R61509V_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//			}
//			else if(DSPTime==250)
//			{
//				R61509V_Fill(252,180,300,200-2,R61509V_MAGENTA);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//			}			
//		}
//		else if(NumFW==7&&(Onlinede>>6&0x01))
//		{
//			if(DSPTime==500)
//			{
//				R61509V_Fill(302,180,350,200-2,R61509V_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//			}
//			else if(DSPTime==250)
//			{
//				R61509V_Fill(302,180,350,200-2,R61509V_MAGENTA);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//			}			
//		}
//		else if(NumFW==8&&(Onlinede>>7&0x01))
//		{
//			if(DSPTime==500)
//			{
//				R61509V_Fill(352,180,400-2,200-2,R61509V_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//			}
//			else if(DSPTime==250)
//			{
//				R61509V_Fill(352,180,400-2,200-2,R61509V_MAGENTA);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//			}			
//		}
//	}
//}
///*******************************************************************************
//* 函数名			:	function
//* 功能描述		:	函数功能说明 
//* 输入			: void
//* 返回值			: void
//*******************************************************************************/
//void LCD_WXS(void)		//位显示
//{
//		if((Onlinede>>0&0x01)==0x01)
//		{
//			R61509V_Fill(2,180,50,200-2,R61509V_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//		}
//		else
//		{
//			R61509V_Fill(2,180,50,200-2,R61509V_RED);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//		}
//		if((Onlinede>>1&0x01)==0x01)
//		{
//			R61509V_Fill(52,180,100,200-2,R61509V_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//		}
//		else
//		{
//			R61509V_Fill(52,180,100,200-2,R61509V_RED);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//		}
//		if((Onlinede>>2&0x01)==0x01)
//		{
//			R61509V_Fill(102,180,150,200-2,R61509V_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//		}
//		else
//		{
//			R61509V_Fill(102,180,150,200-2,R61509V_RED);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//		}
//		if((Onlinede>>3&0x01)==0x01)
//		{
//			R61509V_Fill(152,180,200,200-2,R61509V_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//		}
//		else
//		{
//			R61509V_Fill(152,180,200,200-2,R61509V_RED);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//		}
//		if((Onlinede>>4&0x01)==0x01)
//		{
//			R61509V_Fill(202,180,250,200-2,R61509V_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//		}
//		else
//		{
//			R61509V_Fill(202,180,250,200-2,R61509V_RED);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//		}
//		if((Onlinede>>5&0x01)==0x01)
//		{
//			R61509V_Fill(252,180,300,200-2,R61509V_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//		}
//		else
//		{
//			R61509V_Fill(252,180,300,200-2,R61509V_RED);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//		}
//		if((Onlinede>>6&0x01)==0x01)
//		{
//			R61509V_Fill(302,180,350,200-2,R61509V_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//		}
//		else
//		{
//			R61509V_Fill(302,180,350,200-2,R61509V_RED);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//		}
//		if((Onlinede>>7&0x01)==0x01)
//		{
//			R61509V_Fill(352,180,400-2,200-2,R61509V_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//		}
//		else
//		{
//			R61509V_Fill(352,180,400-2,200-2,R61509V_RED);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
//		}
//}
///*******************************************************************************
//* 函数名			:	function
//* 功能描述		:	函数功能说明 
//* 输入			: void
//* 返回值			: void
//*******************************************************************************/
//void LCD_DDSP(void)		//显示总共请求数量和已发数量
//{
////	u8 i=0;
////	u8 w=2;
//	//请求数量显示
////	for(i=0;i<8;i++)
////	{
////		PL010V13_PrintfString(w,200,16	,"%5d",SumFQ[i]);				//待发药数量，后边的省略号就是可变参数
////		w+=50;
////	}
//	//请求数量显示
//	PL010V13_PrintfString(2,200,16	,"%5d",SumFQ[0]);				//待发药数量，后边的省略号就是可变参数
//	PL010V13_PrintfString(52,200,16	,"%5d",SumFQ[1]);				//待发药数量，后边的省略号就是可变参数
//	PL010V13_PrintfString(102,200,16	,"%5d",SumFQ[2]);				//待发药数量，后边的省略号就是可变参数
//	PL010V13_PrintfString(152,200,16	,"%5d",SumFQ[3]);				//待发药数量，后边的省略号就是可变参数
//	PL010V13_PrintfString(201,200,16	,"%5d",SumFQ[4]);				//待发药数量，后边的省略号就是可变参数
//	PL010V13_PrintfString(251,200,16	,"%5d",SumFQ[5]);				//待发药数量，后边的省略号就是可变参数
//	PL010V13_PrintfString(301,200,16	,"%5d",SumFQ[6]);				//待发药数量，后边的省略号就是可变参数
//	PL010V13_PrintfString(351,200,16	,"%5d",SumFQ[7]);				//待发药数量，后边的省略号就是可变参数

//	//已发数量显示	
//	PL010V13_PrintfString(2,220,16		,"%5d",SumFed[0]);				//待发药数量，后边的省略号就是可变参数
//	PL010V13_PrintfString(52,220,16		,"%5d",SumFed[1]);				//待发药数量，后边的省略号就是可变参数
//	PL010V13_PrintfString(102,220,16	,"%5d",SumFed[2]);				//待发药数量，后边的省略号就是可变参数
//	PL010V13_PrintfString(152,220,16	,"%5d",SumFed[3]);				//待发药数量，后边的省略号就是可变参数
//	PL010V13_PrintfString(201,220,16	,"%5d",SumFed[4]);				//待发药数量，后边的省略号就是可变参数
//	PL010V13_PrintfString(251,220,16	,"%5d",SumFed[5]);				//待发药数量，后边的省略号就是可变参数
//	PL010V13_PrintfString(301,220,16	,"%5d",SumFed[6]);				//待发药数量，后边的省略号就是可变参数
//	PL010V13_PrintfString(351,220,16	,"%5d",SumFed[7]);				//待发药数量，后边的省略号就是可变参数
//}

#endif

